{
  "metadata": {
    "filename": "draft test.txt",
    "import_date": "2025-05-12T17:14:04.931923",
    "valid": true
  },
  "stats": {
    "article_count": 6,
    "word_count": 1358,
    "line_count": 44
  },
  "readability": {
    "flesch": 32.09,
    "smog": 18.8,
    "reading_time": "6.8 minutes"
  },
  "topics": [
    {
      "topic_id": 0,
      "article": "Article 1",
      "article_score": 0.9916639924049377,
      "keywords": [
        "official",
        "language",
        "shall",
        "greek",
        "turkish",
        "republic",
        "text",
        "publish",
        "gazette",
        "court"
      ],
      "raw_content": "The State of Cyprus is an independent and sovereign Republic with a presidential regime, the President being Greek and the Vice President being Turk elected by the Greek and the Turkish Communities of Cyprus respectively as hereinafter in this Constitution provided."
    },
    {
      "topic_id": 1,
      "article": "Article 1A",
      "article_score": 0.9963131546974182,
      "keywords": [
        "republic",
        "flag",
        "greek",
        "shall",
        "turkish",
        "president",
        "fly",
        "right",
        "public",
        "citizen"
      ],
      "raw_content": "No provision of the Constitution shall be deemed to annul laws enacted, acts done or measures taken by the Republic which become necessary by reason of its obligations as a member state of the European Union, nor does it prevent Regulations, Directives or other acts or binding measures of a legislative character, adopted by the European Union or the European Communities or by their institutions or competent bodies thereof on the basis of the Treaties establishing the European Communities or the Treaty of the European Union, from having legal effect in the Republic."
    },
    {
      "topic_id": 2,
      "article": "Article 2",
      "article_score": 0.9993334412574768,
      "keywords": [
        "community",
        "belong",
        "turkish",
        "greek",
        "group",
        "religious",
        "citizen",
        "republic",
        "option",
        "date"
      ],
      "raw_content": "For the purposes of this Constitution\n1. the Greek Community comprises all citizens of the Republic who are of Greek origin and whose mother tongue is Greek or who share the Greek cultural traditions or who are members of the Greek-Orthodox Church;\n2. the Turkish Community comprises all citizens of the Republic who are of Turkish origin and whose mother tongue is Turkish or who share the Turkish cultural traditions or who are Moslems;\n3. citizens of the Republic who do not come within the provisions of paragraph (1) or (2) of this Article shall, within three months of the date of the coming into operation of this Constitution, opt to belong to either the Greek or the Turkish Community as individuals, but, if they belong to a religious group. shall so opt as a religious group and upon such option they shall be deemed to be members of such Community:\nProvided that any citizen of the Republic who belongs to such a religious group may choose not to abide by the option of such group and by a written and signed declaration submitted within one month of the date of such option to the appropriate officer of the Republic and to the Presidents of the Greek and the Turkish Communal Chambers opt to belong to the Community other than that to which such group shall be deemed to belong:\nProvided further that if an option of such religious group is not accepted on the ground that its members are below the requisite number any member of such group may within one month of the date of the refusal of acceptance of such option opt in the aforesaid manner as an individual to which Community he would like to belong.\nFor the purposes of this paragraph a \"religious group\" means a group of persons ordinarily resident in Cyprus professing the same religion and either belonging to the same rite or being subject to the same jurisdiction thereof the number of whom, on the date of the coming into operation of this Constitution, exceeds one thousand out of which at least five hundred become on such date citizens of the Republic:\n4. a person who becomes a citizen of the Republic at any time after three months of the date of the coming into operation of this Constitution shall exercise the option provided in paragraph (3) of this Article within three months of the date of his so becoming a citizen;\n5. a Greek or a Turkish citizen of the Republic who comes within the provisions of paragraph (1) or (2) of this Article may cease to belong to the Community of which he is a member and belong to the other Community upon\na. a written and signed declaration by such citizen to the effect that he desires such change, submitted to the appropriate officer of the Republic and to the Presidents of the Greek and the Turkish Communal Chambers;\nb. the approval of the Communal Chamber of such other Community;\n6. any individual or any religious group deemed to belong to either the Greek or the Turkish Community under the provisions of paragraph (3) of this Article may cease to belong to such Community and be deemed to belong to the other Community upon\na. a written and signed declaration by such individual or religious group to the effect that such change is desired, submitted to the appropriate officer of the Republic and to the Presidents of the Greek and the Turkish Communal Chambers;\nb. the approval of the Communal Chamber of such other Community;\n7.\na. a married woman shall belong to the Community to which her husband\nbelongs;\nb. a male or female child under the age of twenty-one who is not married shall belong to the Community to which his or her father belongs, or, if the father is unknown and he or she has not been adopted, to the Community to which his or her mother belongs"
    },
    {
      "topic_id": 3,
      "article": "Article 3",
      "article_score": 0.9987820982933044,
      "keywords": [
        "greek",
        "turkish",
        "community",
        "shall",
        "right",
        "respectively",
        "holiday",
        "celebrate",
        "national",
        "group"
      ],
      "raw_content": "1. The official languages of the Republic are Greek and Turkish.\n2. Legislative, executive and administrative acts and documents shall be drawn up in both official languages and shall, where under the express provisions of this Constitution promulgation is required, be promulgated by publication in the official Gazette of the Republic in both official languages.\n3. Administrative or other official documents addressed to a Greek or a Turk shall be drawn up in the Greek or the Turkish language respectively.\n4. Judicial proceedings shall be conducted or made and judgments shall be drawn up in the Greek language if the parties are Greek, in the Turkish language if the parties are Turkish, and in both the Greek and the Turkish languages if the parties are Greek and Turkish. The official language or languages to be used for such purposes in all other cases shall be specified by the Rules of Court made by the High Court under Article 163.\n5. Any text in the official Gazette of the Republic shall be published in both official languages in the same issue.\n6\n1. Any difference between the Greek and the Turkish texts of any legislative, executive or administrative act or document published in the official Gazette of the Republic, shall be resolved by a competent court.\n2. The prevailing text of any law or decision of a Communal Chamber published in the official Gazette of the Republic shall be that of the language of the Communal Chamber concerned.\n3. Where any difference arises between the Greek and the Turkish texts of an executive or administrative act or document which, though not published in the official Gazette of the Republic, has otherwise been published, a statement by the Minister or any other authority concerned as to which text should prevail or which should be the correct text shall be final and conclusive.\n4. A competent court may grant such remedies as it may deem just in any case of a difference in the texts as aforesaid.\n7. The two official languages shall be used on coins, currency notes and stamps.\n8. Every person shall have the right to address himself to the authorities of the Republic in either of the official languages."
    },
    {
      "topic_id": 4,
      "article": "Article 4",
      "article_score": 0.9974057674407959,
      "keywords": [
        "official",
        "language",
        "shall",
        "turkish",
        "republic",
        "greek",
        "text",
        "document",
        "administrative",
        "gazette"
      ],
      "raw_content": "1. The Republic shall have its own flag of neutral design and colour, chosen jointly by the President and the Vice-President of the Republic.\n2. The authorities of the Republic and any public corporation or public utility body created by or under the laws of the Republic shall fly the flag of the Republic and they shall have the right to fly on holidays together with the flag of the Republic both the Greek and the Turkish flags at the same time.\n3. The Communal authorities and institutions shall have the right to fly on holidays together with the flag of the Republic either the Greek or the Turkish flag at the same time.\n4. Any citizen of the Republic or any body, corporate or unincorporate other than public, whose members are citizens of the Republic, shall have the right to fly on their premises the flag of the Republic or the Greek or the Turkish flag without any restriction."
    },
    {
      "topic_id": 5,
      "article": "Article 5",
      "article_score": 0.9822462201118469,
      "keywords": [
        "community",
        "belong",
        "republic",
        "greek",
        "group",
        "turkish",
        "citizen",
        "shall",
        "date",
        "religious"
      ],
      "raw_content": "The Greek and the Turkish Communities shall have the right to celebrate respectively the Greek and the Turkish national holidays."
    }
  ]
}